liuaiolos/esp8266-ai/firmware/src/main.cpp
// M5GO v2.6 ESP32 WiFi clock: shows local time plus live Claude Code / Codex CLI
// working status and usage quota, polled from a small bridge service that
// runs on the developer's Mac (see ../bridge/bridge.py).
//
// Display: 320x240 SPI ILI9342C. TFT_eSPI supplies the M5Stack transport and
// coordinate model; the panel-specific init sequence below follows M5Stack's
// official M5GO v2.6/Core implementation. Pins are set in platformio.ini.

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <WiFiClient.h>
#include <WiFiManager.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <TFT_eSPI.h>
#include <AnimatedGIF.h>
#include <Adafruit_NeoPixel.h>
#include "esp32-hal-dac.h"

#include "config.h"
#include "audio/building_pcm.h"
#include "audio/construction_complete_pcm.h"
#include "img/claude_sprite.h"
#include "img/codex_sprite.h"
#include "img/claude_logo.h"
#include "img/codex_logo.h"

TFT_eSPI tft = TFT_eSPI();
WebServer webServer(80);

// M5GO v2.6 uses an ILI9342C panel. M5Stack's official Core library retains
// the ILI9341 coordinate model but selects this different register sequence
// for newer LCD hardware. Applying it after TFT_eSPI::init() lets the rest of
// this firmware keep the proven 320x240 rotation and drawing coordinates.
static void initM5GoV26Panel() {
  auto command = [](uint8_t value) { tft.writecommand(value); };
  auto data = [](uint8_t value) { tft.writedata(value); };

  command(0xC8);
  data(0xFF); data(0x93); data(0x42);

  command(0xC0); // Power control 1
  data(0x12); data(0x12);
  command(0xC1); // Power control 2
  data(0x03);
  command(0xB0);
  data(0xE0);
  command(0xF6);
  data(0x00); data(0x01); data(0x01);

  command(0x36); // Memory access control; M5Stack rotation 0 baseline
  data(0xA8);    // MY | MV, with TFT_BGR color order
  command(0x3A); // 16-bit RGB565
  data(0x55);
  command(0xB6); // Display function control
  data(0x08); data(0x82); data(0x27);

  command(0xE0); // Positive gamma
  const uint8_t positiveGamma[] = {
      0x00, 0x0C, 0x11, 0x04, 0x11, 0x08, 0x37, 0x89,
      0x4C, 0x06, 0x0C, 0x0A, 0x2E, 0x34, 0x0F};
  for (uint8_t value : positiveGamma) data(value);

  command(0xE1); // Negative gamma
  const uint8_t negativeGamma[] = {
      0x00, 0x0B, 0x11, 0x05, 0x13, 0x09, 0x33, 0x67,
      0x48, 0x07, 0x0E, 0x0B, 0x2E, 0x33, 0x0F};
  for (uint8_t value : negativeGamma) data(value);

  command(0x11); // Sleep out
  delay(120);
  command(0x29); // Display on
  tft.invertDisplay(true); // Official M5Stack ILI9342C path enables INVON
}

// ---------- custom sprite storage (LittleFS) ----------
// Custom uploads replace the compiled-in default animation without needing a
// firmware rebuild. You POST a raw .gif straight to /sprite/claude or
// /sprite/codex (the device serves its own upload page at "/"); the ESP8266
// decodes and rescales the GIF *on-device* (AnimatedGIF, line-by-line so it
// never needs a full-canvas buffer) into the wire format below, which the
// display path then reads back frame-by-frame:
//   [1 byte frame count][frame0 bytes][frame1 bytes]...
// Each frame is exactly CLAUDE_SPRITE_W x H (or CODEX_SPRITE_W x H) RGB565
// pixels, byte order matching tools/convert_sprites.py's to_rgb565() so the
// compiled-in defaults and custom uploads share one draw path.
const char *CLAUDE_SPRITE_FILE = "/c.bin";
const char *CODEX_SPRITE_FILE = "/x.bin";
const char *CLAUDE_IDLE_FILE = "/c_idle.bin";
const char *CODEX_IDLE_FILE = "/x_idle.bin";
const char *CLAUDE_GIF_FILE = "/c.gif"; // raw upload, decoded then removed
const char *CODEX_GIF_FILE = "/x.gif";
const int MAX_CUSTOM_FRAMES = 8;
const size_t CLAUDE_FRAME_BYTES = (size_t)CLAUDE_SPRITE_W * CLAUDE_SPRITE_H * 2;
const size_t CODEX_FRAME_BYTES = (size_t)CODEX_SPRITE_W * CODEX_SPRITE_H * 2;

// We never hold a whole sprite frame in RAM. Decoding a GIF needs ~24KB of
// heap for AnimatedGIF's own buffers, which wouldn't fit alongside a static
// full-frame buffer (a 120x120 frame is ~28KB) on the ESP8266's ~80KB. So both
// the display path and the decoder work one screen-row at a time through these
// two small scratch rows (SCREEN_W is the widest we ever need).
uint16_t rowBuf[SCREEN_W];     // current row being drawn / decoded
uint16_t prevRowBuf[SCREEN_W]; // decode only: same row from the previous frame
// ESP32 has enough heap for one decoded custom frame. Caching the active frame
// avoids opening/reading LittleFS once per scanline, which otherwise starves
// the HTTP server during the animation.
uint8_t spriteFrameCache[CODEX_FRAME_BYTES];
// A second frame buffer is used only at the loop seam to blend the final and
// first animation frames. It costs 28.8 KB on this ESP32 but removes the
// visible last-frame -> first-frame snap in non-seamless uploaded GIFs.
uint8_t spriteLoopBridgeCache[CODEX_FRAME_BYTES];

// Sprite/GIF/music payloads are stored in the byte-pre-swapped format emitted
// by tools/convert_sprites.py. TFT_eSPI's default ESP32 pushImage() path sends
// the uint16_t memory bytes as-is, so these rows must be passed unchanged.
inline uint16_t swap565(uint16_t c) { return (uint16_t)((c << 8) | (c >> 8)); }

bool claudeCustom = false;
int claudeCustomFrames = 0;
bool codexCustom = false;
int codexCustomFrames = 0;
bool claudeIdleCustom = false;
int claudeIdleFrames = 0;
bool codexIdleCustom = false;
int codexIdleFrames = 0;
uint32_t spriteRev = 0; // bumped on upload/reset so the Mac mirror re-fetches

const int SCREEN_CX = SCREEN_W / 2, SCREEN_CY = SCREEN_H / 2;
const int RING_MARGIN = 4;      // inset from screen edge
const int RING_THICKNESS = 10;  // ring bar thickness
const unsigned long ANIM_INTERVAL_MS = 90;   // sprite frame advance
const unsigned long ANIM_LOOP_BRIDGE_MS = 45; // short final->first blend
const unsigned long FLASH_INTERVAL_MS = 400; // "urgent" flash speed
const unsigned long SWITCH_BOTH_MS = 2000;   // both apps working: alternate fast
const unsigned long SWITCH_IDLE_MS = 6000;   // neither working: alternate slow

