liuaiolos/esp8266-ai/firmware/src/main.cpp
enum ActiveApp { APP_CLAUDE, APP_CODEX };
// First boot should introduce the device with Codex on screen.  A previously
// saved display-mode preference still takes precedence in loadDisplayMode().
ActiveApp currentApp = APP_CODEX;
unsigned long lastSwitchMs = 0;

// Display override, settable from the Mac app via POST /api/display:
// auto = follow working status, claude/codex = pin that app on screen,
// net/music = show Mac-side telemetry pages instead of the pet.
enum DisplayMode { MODE_AUTO, MODE_CLAUDE, MODE_CODEX, MODE_NET, MODE_MUSIC };
DisplayMode displayMode = MODE_AUTO;
bool appRedrawRequested = false; // defer expensive TFT work until after HTTP replies

// When AUTO and the Mac reports audio playing, the screen auto-switches to the
// music page and back when it stops — same spirit as the Claude/Codex auto
// switch. Only AUTO does this; a pinned mode is always honored as-is.
bool statusMusicPlaying = false;
DisplayMode lastEffectiveMode = MODE_AUTO;

// ---------- net speed mode state ----------
// Rendering is decoupled from the network: pollNet() fetches every 2s and
// only refills a queue of 250ms samples (the bridge samples at 4Hz and tags
// them with a running seq, so nothing is drawn twice or skipped). The sweep
// itself consumes exactly one queued sample every NET_DRAW_INTERVAL_MS, so
// the trace advances at a constant rate no matter how long HTTP takes.
const unsigned long NET_POLL_INTERVAL_MS = 2000; // queue refill cadence
const unsigned long NET_DRAW_INTERVAL_MS = 250;  // one chart step per bridge sample
const int NET_QUEUE = 32;
long netQRx[NET_QUEUE], netQTx[NET_QUEUE]; // ring buffer of pending samples
int netQHead = 0, netQCount = 0;
long netSeq = -1;                          // last bridge sample seq consumed into the queue
long netCurRx = 0, netCurTx = 0;           // smoothed readout for the header
unsigned long lastNetPollMs = 0;
unsigned long lastNetDrawMs = 0;
bool netChromeDrawn = false;
bool netHeaderDirty = false;

// Chart layout (task-manager style scrolling area chart, newest at the right)
const int NET_CHART_X = 8, NET_CHART_Y = 60, NET_CHART_W = 224, NET_CHART_H = 128;
long netHistRx[NET_CHART_W], netHistTx[NET_CHART_W]; // one 250ms sample per column
long netScale = 10240;    // current "nice" full-scale value (whole chart shares it)
String netLastDl, netLastUl, netLastScaleText; // change detection for partial redraws

// ---------- music mode state ----------
const int MUSIC_COVER_W = 128;
const int MUSIC_COVER_H = 128;
// Title/artist come as a Mac-rendered bitmap strip (232x44) because the
// panel fonts are ASCII-only and CJK titles would render as blanks.
const int MUSIC_TEXT_W = 232;
const int MUSIC_TEXT_H = 44;
const int MUSIC_TEXT_X = 4, MUSIC_TEXT_Y = 150;
const unsigned long MUSIC_POLL_INTERVAL_MS = 2000;
String musicTitle, musicArtist, musicAlbum;
bool musicPlaying = false;
int musicElapsed = 0, musicDuration = 0;
int musicArtworkRev = -1;
int musicTextRev = -1;
bool musicHasArtwork = false;
bool musicChromeDrawn = false;
unsigned long lastMusicPollMs = 0;

int claudeFrame = 0;
int codexFrame = 0;
bool claudeLoopBridgePending = false;
bool codexLoopBridgePending = false;
unsigned long lastAnimMs = 0;

bool flashOn = true;
unsigned long lastFlashMs = 0;

// Bridge host is not asked for during first-time WiFi setup: the Mac/Windows
// bridge discovers the device and pairs automatically (or set via /api/bridge).
String bridgeHost;

struct ClaudeStatus {
  String status = "unknown";
  long tokensToday = 0;
  int sessionMin = 0;
  int sessionWindowMin = 300;
  float fiveHourPct = -1; // real OAuth quota from the bridge, -1 = unknown
  int fiveHourResetMin = -1; // minutes until the 5h window resets
  float sevenDayPct = -1;
  int sevenDayResetMin = -1; // minutes until the 7-day window resets
  bool needsInput = false; // waiting on a permission/approval prompt
};

struct CodexStatus {
  String status = "unknown";
  long tokensToday = 0;
  float primaryPct = -1;
  int primaryResetMin = -1;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
  bool needsInput = false;
};

ClaudeStatus claudeStatus;
CodexStatus codexStatus;

unsigned long lastPollMs = 0;
unsigned long lastSuccessMs = 0;
bool everPolled = false;
bool mainUiShown = false;      // false while the Wi-Fi configuration portal is visible
bool webServerStarted = false; // deferred because the portal also occupies port 80
uint8_t bridgeFailCount = 0;
unsigned long lastWiFiReconnectMs = 0;
bool statusBaselineReady = false;
unsigned long beepUntilMs = 0;

// The M5GO Bottom carries ten SK6812 RGB LEDs on GPIO 15. Keep animations
// non-blocking so status lights never interrupt display rendering or bridge I/O.
Adafruit_NeoPixel statusLeds(RGB_LED_COUNT, RGB_LED_PIN, NEO_GRB + NEO_KHZ800);
enum LedEffect { LED_STATUS, LED_WORK_STARTED, LED_WORK_COMPLETED };
LedEffect ledEffect = LED_STATUS;
unsigned long ledEffectStartedMs = 0;
unsigned long lastLedRefreshMs = 0;
const unsigned long LED_REFRESH_MS = 30;
const unsigned long LED_WORK_STARTED_MS = 500;
const unsigned long LED_WORK_COMPLETED_MS = 1200;

struct LedConfig {
  uint8_t red;
  uint8_t green;
  uint8_t blue;
  uint8_t brightness; // 0-100
};

LedConfig workingLed = {0, 255, 0, 50};
LedConfig approvalLed = {255, 0, 0, 50};
LedConfig idleLed = {0, 0, 255, 8};
LedConfig startLed = {0, 255, 170, 55};
LedConfig completionLed = {0, 150, 255, 55};

uint8_t scaleLedChannel(uint8_t channel, uint8_t brightness, uint8_t intensity = 255) {
  return (uint16_t)channel * brightness * intensity / (100UL * 255UL);
}

uint8_t ledBreathLevel(unsigned long nowMs) {
  const unsigned long periodMs = 1800;
  unsigned long phase = nowMs % periodMs;
  unsigned long half = periodMs / 2;
  unsigned long ramp = phase < half ? phase : periodMs - phase;
  return 35 + (uint8_t)(ramp * 220 / half);
}

void fillStatusLeds(const LedConfig &config, uint8_t intensity = 255) {
  uint32_t color = statusLeds.Color(scaleLedChannel(config.red, config.brightness, intensity),
                                    scaleLedChannel(config.green, config.brightness, intensity),
                                    scaleLedChannel(config.blue, config.brightness, intensity));
  for (int i = 0; i < RGB_LED_COUNT; ++i) statusLeds.setPixelColor(i, color);
}

void triggerLedEffect(LedEffect effect) {
  ledEffect = effect;
  ledEffectStartedMs = millis();
  lastLedRefreshMs = 0;
}

void updateStatusLeds() {
  unsigned long nowMs = millis();
  if (nowMs - lastLedRefreshMs < LED_REFRESH_MS) return;
  lastLedRefreshMs = nowMs;

  if (ledEffect != LED_STATUS) {
    unsigned long duration = ledEffect == LED_WORK_STARTED ? LED_WORK_STARTED_MS : LED_WORK_COMPLETED_MS;
    unsigned long elapsed = nowMs - ledEffectStartedMs;
    if (elapsed < duration) {
      int head = (int)((elapsed * RGB_LED_COUNT) / duration);
      statusLeds.clear();
      for (int i = 0; i < RGB_LED_COUNT; ++i) {
        int distance = abs(i - head);
        if (distance == 0) {
          const LedConfig &config = ledEffect == LED_WORK_STARTED ? startLed : completionLed;
          statusLeds.setPixelColor(i, statusLeds.Color(scaleLedChannel(config.red, config.brightness),
                                                        scaleLedChannel(config.green, config.brightness),
                                                        scaleLedChannel(config.blue, config.brightness)));
        } else if (distance == 1) {
          const LedConfig &config = ledEffect == LED_WORK_STARTED ? startLed : completionLed;
          statusLeds.setPixelColor(i, statusLeds.Color(scaleLedChannel(config.red, config.brightness, 48),
                                                        scaleLedChannel(config.green, config.brightness, 48),
                                                        scaleLedChannel(config.blue, config.brightness, 48)));
        }
      }
      statusLeds.show();
      return;
    }
    ledEffect = LED_STATUS;
  }

  if (claudeStatus.needsInput || codexStatus.needsInput) {
    fillStatusLeds(approvalLed, ledBreathLevel(nowMs));
  } else if (claudeStatus.status == "working" || codexStatus.status == "working") {
    fillStatusLeds(workingLed, ledBreathLevel(nowMs));
  } else {
    fillStatusLeds(idleLed);
  }
  statusLeds.show();
}

