liuaiolos/esp8266-ai/firmware/src/main.cpp
// ---------- WiFi / bridge polling ----------

WiFiManager wifiManager; // kept global so its non-blocking portal can run from loop()

void configModeCallback(WiFiManager *wm) {
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("WiFi setup needed", 8, 32, 2);
  tft.drawString("Connect phone to AP:", 8, 62, 2);
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.drawString(WIFI_PORTAL_AP_NAME, 8, 87, 2);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("then open 192.168.4.1", 8, 117, 2);
  tft.setTextColor(TFT_CYAN, TFT_BLACK);
  tft.drawString("Or plug into USB", 8, 155, 2);
  tft.drawString("for wired status", 8, 178, 2);
  tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  tft.drawString("Firmware v" FW_VERSION, 8, 215, 2);
}

void setupWiFi() {
  wifiManager.setAPCallback(configModeCallback);
  wifiManager.setConfigPortalBlocking(false);

  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.drawString("Connecting WiFi...", 8, 100, 2);

  Serial.println("[wifi] starting WiFiManager autoConnect (non-blocking portal)...");
  bool ok = wifiManager.autoConnect(WIFI_PORTAL_AP_NAME);
  // Keep the HTTP admin endpoint responsive on this battery-powered ESP32;
  // modem-sleep can otherwise add multi-second stalls while the TFT is busy.
  WiFi.setSleep(false);
  Serial.printf("[wifi] autoConnect result=%d ssid=%s ip=%s\n", ok, WiFi.SSID().c_str(),
                WiFi.localIP().toString().c_str());
  Serial.printf("[wifi] bridge host = '%s'\n", bridgeHost.c_str());
}

bool parseStatusJson(const String &payload) {
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, payload);
  if (err) return false;

  JsonObject c = doc["claude"];
  if (!c.isNull()) {
    claudeStatus.status = c["status"] | "unknown";
    claudeStatus.tokensToday = c["tokens_today"] | 0;
    claudeStatus.sessionMin = c["session_min"] | 0;
    claudeStatus.sessionWindowMin = c["session_window_min"] | 300;
    claudeStatus.fiveHourPct = c["five_hour_pct"] | -1.0;
    claudeStatus.fiveHourResetMin = c["five_hour_reset_min"] | -1;
    claudeStatus.sevenDayPct = c["seven_day_pct"] | -1.0;
    claudeStatus.sevenDayResetMin = c["seven_day_reset_min"] | -1;
    claudeStatus.needsInput = c["needs_input"] | false;
  }

  JsonObject x = doc["codex"];
  if (!x.isNull()) {
    codexStatus.status = x["status"] | "unknown";
    codexStatus.tokensToday = x["tokens_today"] | 0;
    codexStatus.primaryPct = x["primary_pct"] | -1.0;
    codexStatus.primaryResetMin = x["primary_reset_min"] | -1;
    codexStatus.weeklyPct = x["weekly_pct"] | -1.0;
    codexStatus.weeklyResetMin = x["weekly_reset_min"] | -1;
    codexStatus.needsInput = x["needs_input"] | false;
  }
  statusMusicPlaying = doc["music_playing"] | false;
  return true;
}

// The mode actually rendered. In AUTO: a pending approval prompt wins (stay on
// the pet so its border can flash red at you), otherwise audio promotes to the
// music page.
DisplayMode effectiveMode() {
  if (displayMode == MODE_AUTO) {
    if (claudeStatus.needsInput || codexStatus.needsInput) return MODE_AUTO;
    if (statusMusicPlaying && WiFi.status() == WL_CONNECTED) return MODE_MUSIC;
  }
  return displayMode;
}

void pollBridge() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) {
    if (WiFi.status() != WL_CONNECTED && millis() - lastWiFiReconnectMs > 10000) {
      lastWiFiReconnectMs = millis();
      Serial.println("[wifi] disconnected; attempting reconnect");
      WiFi.reconnect();
    }
    Serial.printf("[bridge] skip poll: wifi=%d host='%s'\n", WiFi.status() == WL_CONNECTED, bridgeHost.c_str());
    return;
  }

  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + BRIDGE_DEFAULT_PATH;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);

  if (!http.begin(client, url)) {
    Serial.println("[bridge] http.begin() failed");
    return;
  }
  int code = http.GET();
  Serial.printf("[bridge] GET %s -> %d\n", url.c_str(), code);
  if (code == HTTP_CODE_OK) {
    String payload = http.getString();
    bool wasClaudeWorking = claudeStatus.status == "working";
    bool wasCodexWorking = codexStatus.status == "working";
    if (parseStatusJson(payload)) {
      bool completed = statusBaselineReady &&
                       ((wasClaudeWorking && claudeStatus.status != "working") ||
                        (wasCodexWorking && codexStatus.status != "working"));
      bool started = statusBaselineReady &&
                     ((!wasClaudeWorking && claudeStatus.status == "working") ||
                      (!wasCodexWorking && codexStatus.status == "working"));
      lastSuccessMs = millis();
      everPolled = true;
      bridgeFailCount = 0;
      statusBaselineReady = true;
      if (started) {
        triggerLedEffect(LED_WORK_STARTED);
        triggerWorkStartedBeep();
      }
      if (completed) {
        triggerLedEffect(LED_WORK_COMPLETED);
        triggerCompletionBeep();
      }
      Serial.printf("[bridge] claude=%s tok=%ld | codex=%s tok=%ld primary=%.0f%%\n",
                    claudeStatus.status.c_str(), claudeStatus.tokensToday,
                    codexStatus.status.c_str(), codexStatus.tokensToday, codexStatus.primaryPct);
    } else {
      Serial.println("[bridge] JSON parse failed");
    }
  } else {
    // Treat an isolated timeout as a transient LAN hiccup. Keep the last
    // good state until several consecutive failures, avoiding visible
    // offline/working flicker when the Mac briefly wakes or changes Wi-Fi.
    if (bridgeFailCount < 255) bridgeFailCount++;
    if (bridgeFailCount >= 3) {
      claudeStatus.status = "offline";
      codexStatus.status = "offline";
    }
  }
  http.end();
  DisplayMode eff = effectiveMode();
  if (eff != MODE_NET && eff != MODE_MUSIC) {
    // Only a real app switch clears the screen; a plain data refresh paints
    // in place so the poll doesn't flash the whole display.
    if (updateActiveApp()) drawActiveApp();
    else refreshActiveApp();
  }
}

// ---------- wired USB serial bridge ----------
// When the clock is connected by USB, the macOS bridge pushes the same status
// and network JSON it normally serves over HTTP. This works without Wi-Fi and
// bypasses AP client isolation. Non-protocol serial logs are ignored.
unsigned long lastSerialFrameMs = 0;
bool wiredEverLinked = false;
char serialLine[1600];
size_t serialLineLen = 0;

bool wiredActive() { return wiredEverLinked && millis() - lastSerialFrameMs < 15000UL; }

void showMainUiIfNeeded() {
  if (mainUiShown) return;
  mainUiShown = true;
  drawStaticChrome();
  updateActiveApp();
  drawActiveApp();
}

void handleSerialFrame(char *line) {
  lastSerialFrameMs = millis();
  wiredEverLinked = true;
  if (!strncmp(line, "#HELLO", 6)) {
    Serial.printf("#DEVICE {\"name\":\"aiclock\",\"fw\":\"%s\"}\n", FW_VERSION);
    return;
  }
  if (!strncmp(line, "#STATUS ", 8)) {
    bool wasClaudeWorking = claudeStatus.status == "working";
    bool wasCodexWorking = codexStatus.status == "working";
    if (parseStatusJson(String(line + 8))) {
      bool completed = statusBaselineReady &&
                       ((wasClaudeWorking && claudeStatus.status != "working") ||
                        (wasCodexWorking && codexStatus.status != "working"));
      bool started = statusBaselineReady &&
                     ((!wasClaudeWorking && claudeStatus.status == "working") ||
                      (!wasCodexWorking && codexStatus.status == "working"));
      lastSuccessMs = millis();
      everPolled = true;
      bridgeFailCount = 0;
      statusBaselineReady = true;
      if (started) {
        triggerLedEffect(LED_WORK_STARTED);
        triggerWorkStartedBeep();
      }
      if (completed) {
        triggerLedEffect(LED_WORK_COMPLETED);
        triggerCompletionBeep();
      }
      showMainUiIfNeeded();
      DisplayMode eff = effectiveMode();
      if (eff != MODE_NET && eff != MODE_MUSIC) {
        if (updateActiveApp()) drawActiveApp();
        else refreshActiveApp();
      }
    }
    return;
  }
  if (!strncmp(line, "#NET ", 5)) {
    handleNetPayload(String(line + 5));
    return;
  }
  if (!strncmp(line, "#CMD ", 5)) {
    JsonDocument doc;
    if (deserializeJson(doc, line + 5)) return;
    if (doc["brightness"].is<int>()) {
      brightness = constrain(doc["brightness"].as<int>(), 0, 100);
      applyBrightness();
      saveBrightness();
    }
    if (doc["volume"].is<int>()) {
      completionVolume = constrain(doc["volume"].as<int>(), 0, 100);
      saveCompletionVolume();
    }
    if (doc["preview_sound"] == true) triggerCompletionBeep();
    const char *mode = doc["display"] | (const char *)nullptr;
    if (mode) {
      String value(mode);
      if (value == "auto") displayMode = MODE_AUTO;
      else if (value == "claude") displayMode = MODE_CLAUDE;
      else if (value == "codex") displayMode = MODE_CODEX;
      else if (value == "net") displayMode = MODE_NET;
      else if (value == "music") displayMode = MODE_MUSIC;
      saveDisplayMode();
    }
  }
}

