liuaiolos/esp8266-ai/firmware/src/main.cpp
void pumpSerial() {
  while (Serial.available()) {
    char ch = (char)Serial.read();
    if (ch == '\n' || ch == '\r') {
      if (serialLineLen > 0 && serialLine[0] == '#') {
        serialLine[serialLineLen] = 0;
        handleSerialFrame(serialLine);
      }
      serialLineLen = 0;
    } else if (serialLineLen < sizeof(serialLine) - 1) {
      serialLine[serialLineLen++] = ch;
    } else {
      serialLineLen = 0;
    }
  }
}

// ---------- web admin ----------

String htmlEscape(const String &s) {
  String out = s;
  out.replace("&", "&amp;");
  out.replace("<", "&lt;");
  out.replace(">", "&gt;");
  out.replace("\"", "&quot;");
  return out;
}

String lightControlRow(const char *label, const char *name, const LedConfig &config) {
  String brightnessId = String(name) + "Brightness";
  String html = "<label>" + String(label) + "</label><div class='light-row'>";
  html += "<input type='color' name='" + String(name) + "_color' value='" + ledColorHex(config) + "'>";
  html += "<input type='range' min='0' max='100' name='" + String(name) + "_brightness' value='" +
          String(config.brightness) + "' oninput=\"document.getElementById('" + brightnessId +
          "').textContent=this.value+'%'\">";
  html += "<span id='" + brightnessId + "'>" + String(config.brightness) + "%</span></div>";
  return html;
}

void handleRoot() {
  String age = everPolled ? String((millis() - lastSuccessMs) / 1000) + "s ago" : "never";
  String html;
  html.reserve(5600);
  html += "<!DOCTYPE html><html><head><meta charset='utf-8'>";
  html += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
  html += "<title>AI Clock 设置</title>";
  html += "<style>body{font-family:-apple-system,sans-serif;max-width:480px;margin:24px "
          "auto;padding:0 16px;color:#222} h1{font-size:20px} label{display:block;margin-top:16px;font-weight:600}"
          "input{width:100%;box-sizing:border-box;padding:8px;font-size:16px;margin-top:4px}"
          "button{margin-top:16px;padding:10px 20px;font-size:16px;background:#2563eb;color:#fff;"
          "border:none;border-radius:6px}"
          ".light-row{display:flex;align-items:center;gap:10px;margin-top:4px}"
          ".light-row input[type=color]{width:44px;height:34px;padding:2px}"
          ".light-row input[type=range]{margin:0;flex:1}.light-row span{width:42px;text-align:right}"
          "table{margin-top:20px;border-collapse:collapse;width:100%}"
          "td{padding:4px 8px;border-bottom:1px solid #eee;font-size:14px}"
          ".dot{display:inline-block;width:10px;height:10px;border-radius:50%;margin-right:6px}"
          "</style></head><body>";
  html += "<h1>AI Clock 设置</h1>";

  html += "<form method='POST' action='/save'>";
  html += "<label>Bridge host (ip:port)</label>";
  html += "<input name='bridge' value='" + htmlEscape(bridgeHost) + "' placeholder='192.168.1.181:8765'>";
  html += "<button type='submit'>保存</button>";
  html += "</form>";

  // Backlight brightness slider: applies live on release (PWM, persisted).
  html += "<h2 style='font-size:16px;margin-top:28px'>屏幕亮度</h2>";
  html += "<input type='range' min='0' max='100' value='" + String(brightness) + "' id='bri' "
          "oninput=\"document.getElementById('briv').textContent=this.value+'%'\" "
          "onchange=\"fetch('/api/brightness',{method:'POST',headers:{'Content-Type':"
          "'application/x-www-form-urlencoded'},body:'level='+this.value})\">";
  html += "<div style='font-size:13px;color:#555'>当前：<span id='briv'>" + String(brightness) +
          "%</span>（0 = 熄屏，设置立即生效并记住）</div>";

  html += "<h2 style='font-size:16px;margin-top:28px'>工作提示音音量</h2>";
  html += "<input type='range' min='0' max='100' value='" + String(completionVolume) + "' id='vol' "
          "oninput=\"document.getElementById('volv').textContent=this.value+'%'\" "
          "onchange=\"fetch('/api/volume',{method:'POST',headers:{'Content-Type':"
          "'application/x-www-form-urlencoded'},body:'level='+this.value})\">";
  html += "<div style='font-size:13px;color:#555'>当前：<span id='volv'>" + String(completionVolume) +
          "%</span>（0 = 静音，设置会保存）</div>";
  html += "<button type='button' onclick=\"fetch('/api/preview-sound',{method:'POST'})\" "
          "style='margin-top:8px;padding:7px 12px;font-size:13px'>试听完成提示音</button>";

  html += "<h2 style='font-size:16px;margin-top:28px'>底座状态灯</h2>";
  html += "<p style='font-size:13px;color:#555'>颜色和亮度会保存到设备；呼吸与扫光效果保持不变。</p>";
  html += "<form onsubmit=\"saveLights(this);return false;\">";
  html += lightControlRow("工作中（绿色呼吸）", "working", workingLed);
  html += lightControlRow("等待审批（红色呼吸）", "approval", approvalLed);
  html += lightControlRow("空闲（低亮常亮）", "idle", idleLed);
  html += lightControlRow("工作开始（扫光）", "start", startLed);
  html += lightControlRow("工作完成（扫光）", "completion", completionLed);
  html += "<button type='submit'>保存状态灯设置</button></form>";

  html += "<h2 style='font-size:16px;margin-top:28px'>额度显示</h2>";
  html += "<select id='quota' onchange=\"fetch('/api/quota-display',{method:'POST',headers:{'Content-Type':"
          "'application/x-www-form-urlencoded'},body:'mode='+this.value})\">";
  html += "<option value='used'" + String(showQuotaRemaining ? "" : " selected") + ">显示已用</option>";
  html += "<option value='remaining'" + String(showQuotaRemaining ? " selected" : "") + ">显示剩余</option>";
  html += "</select><div style='font-size:13px;color:#555;margin-top:4px'>同时影响进度环和 5h / Wk 百分比，设置会保存。</div>";

  // On-device GIF upload: replaces a character's animation without reflashing.
  html += "<h2 style='font-size:16px;margin-top:28px'>桌宠动画（上传 GIF）</h2>";
  html += "<p style='font-size:13px;color:#555'>上传一个 .gif，设备会在板上解码并缩放到对应角色的尺寸，"
          "立刻替换动画，无需重新编译或烧录。GIF 太大可能因内存不足解码失败，换小一点的即可。</p>";
  html += "<form id='gifForm' method='POST' enctype='multipart/form-data' onsubmit='return setGifAction()'>";
  html += "<label>角色</label>";
  html += "<select id='gifTarget'><option value='codex'>Codex</option><option value='claude'>Claude</option></select>";
  html += "<label>GIF 文件</label><input type='file' name='file' accept='.gif' required>";
  html += "<button type='submit'>上传并应用</button>";
  html += "</form>";
  html += "<script>function setGifAction(){"
          "document.getElementById('gifForm').action='/sprite/'+document.getElementById('gifTarget').value;"
          "return true;}function saveLights(form){fetch('/api/lights',{method:'POST',body:new URLSearchParams(new FormData(form))})"
          ".then(function(){location.reload();});}</script>";

  html += "<table>";
  html += "<tr><td>WiFi SSID</td><td>" + htmlEscape(WiFi.SSID()) + "</td></tr>";
  html += "<tr><td>设备 IP</td><td>" + WiFi.localIP().toString() + "</td></tr>";
  html += "<tr><td>上次桥接更新</td><td>" + age + "</td></tr>";
  html += "<tr><td>数据连接</td><td>" + String(wiredActive() ? "USB 串口直连" : "Wi-Fi 网络") + "</td></tr>";
  html += "<tr><td>Codex</td><td>" + htmlEscape(codexStatus.status) + ", " +
          formatTokens(codexStatus.tokensToday) + " tok, " +
          (codexStatus.primaryPct >= 0
              ? "5h " + String(codexStatus.primaryPct, 0) + "%"
              : "周 " + (codexStatus.weeklyPct >= 0 ? String(codexStatus.weeklyPct, 0) + "%" : "?")) +
          "</td></tr>";
  html += "<tr><td>Claude</td><td>" + htmlEscape(claudeStatus.status) + ", " +
          formatTokens(claudeStatus.tokensToday) + " tok</td></tr>";
  html += "</table>";

