liuaiolos/esp8266-ai/firmware/src/main.cpp
void processPendingSpriteDecode() {
  if (!spriteDecodePending) return;
  spriteDecodePending = false;
  ActiveApp slot = spriteDecodeSlot;
  bool working = spriteDecodeWorking;
  const char *gifPath = (slot == APP_CLAUDE) ? (working ? "/c_work.gif" : "/c_idle.gif")
                                            : (working ? "/x_work.gif" : "/x_idle.gif");
  const char *binPath = (slot == APP_CLAUDE) ? (working ? CLAUDE_SPRITE_FILE : CLAUDE_IDLE_FILE)
                                            : (working ? CODEX_SPRITE_FILE : CODEX_IDLE_FILE);
  int tw = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_W : CODEX_SPRITE_W;
  int th = (slot == APP_CLAUDE) ? CLAUDE_SPRITE_H : CODEX_SPRITE_H;
  bool ok = decodeGifToBin(gifPath, binPath, tw, th);
  LittleFS.remove(gifPath);
  if (ok) {
    spriteRev++;
    loadCustomSpriteState();
    if (slot == APP_CLAUDE) claudeFrame = 0;
    else codexFrame = 0;
    if (currentApp == slot) drawActiveApp();
    Serial.println("[sprite] gif decoded & applied");
  } else {
    Serial.println("[sprite] gif decode FAILED");
  }
}

void setupWebServer() {
  webServer.on("/", HTTP_GET, handleRoot);
  webServer.on("/save", HTTP_POST, handleSave);
  webServer.on("/reset-wifi", HTTP_POST, handleResetWifi);
  webServer.on("/api/info", HTTP_GET, handleApiInfo);
  webServer.on("/api/display", HTTP_POST, handleApiDisplay);
  webServer.on("/api/bridge", HTTP_POST, handleApiBridge);
  webServer.on("/api/brightness", HTTP_POST, handleApiBrightness);
  webServer.on("/api/volume", HTTP_POST, handleApiVolume);
  webServer.on("/api/preview-sound", HTTP_POST, handleApiPreviewSound);
  webServer.on("/api/quota-display", HTTP_POST, handleApiQuotaDisplay);
  webServer.on("/api/lights", HTTP_POST, handleApiLights);
  webServer.on("/sprite/claude/reset", HTTP_POST, []() { handleSpriteReset(APP_CLAUDE); });
  webServer.on("/sprite/codex/reset", HTTP_POST, []() { handleSpriteReset(APP_CODEX); });
  webServer.on("/sprite/claude/raw", HTTP_GET, []() { handleSpriteRaw(APP_CLAUDE); });
  webServer.on("/sprite/codex/raw", HTTP_GET, []() { handleSpriteRaw(APP_CODEX); });
  webServer.on(
      "/sprite/claude", HTTP_POST, []() { handleSpriteUploadDone(APP_CLAUDE); },
      []() { handleSpriteUploadChunk(CLAUDE_GIF_FILE); });
  webServer.on(
      "/sprite/codex", HTTP_POST, []() { handleSpriteUploadDone(APP_CODEX); },
      []() { handleSpriteUploadChunk(CODEX_GIF_FILE); });
  webServer.on("/sprite/claude/work", HTTP_POST, []() { handleSpriteUploadDone(APP_CLAUDE, true); },
               []() { handleSpriteUploadChunk("/c_work.gif"); });
  webServer.on("/sprite/claude/idle", HTTP_POST, []() { handleSpriteUploadDone(APP_CLAUDE, false); },
               []() { handleSpriteUploadChunk("/c_idle.gif"); });
  webServer.on("/sprite/codex/work", HTTP_POST, []() { handleSpriteUploadDone(APP_CODEX, true); },
               []() { handleSpriteUploadChunk("/x_work.gif"); });
  webServer.on("/sprite/codex/idle", HTTP_POST, []() { handleSpriteUploadDone(APP_CODEX, false); },
               []() { handleSpriteUploadChunk("/x_idle.gif"); });
  webServer.begin();
  Serial.printf("[web] admin server listening on http://%s/\n", WiFi.localIP().toString().c_str());
}

// Keep HTTP processing off the Arduino UI loop. ESP32 has FreeRTOS tasks
// rather than separate processes; pin the lightweight WebServer task to the
// other core so TFT SPI drawing cannot starve management requests.
void webServerTask(void *) {
  for (;;) {
    webServer.handleClient();
    vTaskDelay(pdMS_TO_TICKS(1));
  }
}

void startWebServerIfNeeded() {
  if (webServerStarted || WiFi.status() != WL_CONNECTED) return;
  setupWebServer();
  webServerStarted = true;
  xTaskCreatePinnedToCore(webServerTask, "http", 6144, nullptr, 1, nullptr, 0);
}

// ---------- Arduino entry points ----------

void setup() {
  Serial.setRxBufferSize(2048);
  Serial.begin(115200);
  // The M5 custom partition is explicitly named "littlefs". A freshly
  // flashed volume is blank, so format that exact partition once on failure
  // and then mount it again. Passing the label avoids Core-specific automatic
  // partition discovery that can miss the custom label.
  const char *littlefsLabel = "littlefs";
  bool fsMounted = LittleFS.begin(false, "/littlefs", 10, littlefsLabel);
  if (!fsMounted) {
    Serial.println("[fs] initial LittleFS mount failed; formatting partition");
    if (LittleFS.format()) fsMounted = LittleFS.begin(false, "/littlefs", 10, littlefsLabel);
  }
  if (!fsMounted) {
    Serial.println("[fs] LittleFS mount failed; persistent settings unavailable");
  } else {
    Serial.println("[fs] LittleFS mounted");
  }
  loadBridgeHost();
  loadBrightness();
  loadCompletionVolume();
  loadQuotaDisplay();
  loadDisplayMode();
  loadLedSettings();
  loadCustomSpriteState();

  tft.init();
  initM5GoV26Panel();
  // M5Stack's official Core1 display wrapper uses rotation 1 after selecting
  // the ILI9342C init path, yielding the expected 320x240 landscape canvas.
  tft.setRotation(1);
  tft.fillScreen(TFT_BLACK);
  ledcSetup(0, BRIGHTNESS_PWM_FREQ, 8);
  ledcAttachPin(TFT_BL, 0);
  applyBrightness();
  ledcSetup(SPEAKER_CHANNEL, 2000, 8);
  ledcAttachPin(SPEAKER_PIN, SPEAKER_CHANNEL);
  ledcWriteTone(SPEAKER_CHANNEL, 0);
  statusLeds.begin();
  statusLeds.clear();
  statusLeds.show();

  setupWiFi();
  if (WiFi.status() == WL_CONNECTED) {
    startWebServerIfNeeded();
    tft.fillScreen(TFT_BLACK);
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.drawString("WiFi connected", 8, 70, 2);
    tft.drawString("Admin page:", 8, 100, 2);
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.drawString("http://" + WiFi.localIP().toString(), 8, 125, 2);
    delay(3000);
    showMainUiIfNeeded();
    pollBridge();
  }
}

void loop() {
  wifiManager.process();
  pumpSerial();
  if (previewSoundRequested) {
    previewSoundRequested = false;
    triggerCompletionBeep();
  }
  if (!webServerStarted && WiFi.status() == WL_CONNECTED) {
    startWebServerIfNeeded();
    showMainUiIfNeeded();
    lastPollMs = 0;
  }
  if (!mainUiShown) return;

